function  СведенияОВнешнейОбработке(ВерсияБСП = "") Экспорт
    result = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке(ВерсияБСП);
	result.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительныйОтчет();
	result.Версия ="1.0.0";
	result.Информация="Формування звіту по собівартості продажів в розрізі контрагентів";
	result.Наименование = "Собівартість по документам реалізації";
	
	command = result.Команды.Добавить();
	command.Идентификатор =  "СобівартістьПоДокументамРеалізації";
	command.Представление = "СобівартістьПоДокументамРеалізації";
	command.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
	command.Модификатор = "ПечатьMXL";
	//
	//result.Вставить("Команды",commands);
	//result.Вставить("БезопасныйРежим",false);
	return result;
	
endfunction	